In [41]:
import pandas as pd

In [42]:
pd.DataFrame({'Yes': [50, 21], 'No': [131, 2]})

   Yes   No
0   50  131
1   21    2

In [8]:
pd.DataFrame({'Blue':[20,3],'Yellow':[30,4]},index=['Boys','Girls'])

       Blue  Yellow
Boys     20      30
Girls     3       4

In [10]:
pd.Series([2,5,7,1,6])

0    2
1    5
2    7
3    1
4    6
dtype: int64

In [14]:
pd.Series([2,5,7],index=['Boys','Girls','Mixed'],name='Product A')

Boys     2
Girls    5
Mixed    7
Name: Product A, dtype: int64

In [17]:
Student_Performance = pd.read_csv('/Users/oluwatoyin.moronfolu/OneDrive - VFD Group/Downloads/datascience/week 2/StudentsPerformance.csv')

In [18]:
Student_Performance.shape

(1000, 8)

In [19]:
Student_Performance.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [22]:
pd.DataFrame({'Apples':[30],'Bananas':[21]})

   Apples  Bananas
0      30       21

In [43]:
Student_Performance = pd.read_csv('/Users/oluwatoyin.moronfolu/OneDrive - VFD Group/Downloads/datascience/week 2/StudentsPerformance.csv')
pd.set_option('max_rows',5)

In [45]:
Student_Performance

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
...,...,...,...,...,...,...,...,...
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

In [26]:
Student_Performance.gender

0      female
1      female
        ...
998    female
999    female
Name: gender, Length: 1000, dtype: object

In [27]:
Student_Performance['gender']

0      female
1      female
        ...
998    female
999    female
Name: gender, Length: 1000, dtype: object

In [28]:
Student_Performance['gender'][0]

'female'

In [29]:
Student_Performance.iloc[0]

gender             female
race/ethnicity    group B
                   ...
reading score          72
writing score          74
Name: 0, Length: 8, dtype: object

In [30]:
Student_Performance.iloc[:,0]

0      female
1      female
        ...
998    female
999    female
Name: gender, Length: 1000, dtype: object

In [31]:
Student_Performance.iloc[:3,0]

0    female
1    female
2    female
Name: gender, dtype: object

In [33]:
Student_Performance.gender=='female'

0      True
1      True
       ...
998    True
999    True
Name: gender, Length: 1000, dtype: bool

In [46]:
Student_Performance.loc[Student_Performance.gender=='female']

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
...,...,...,...,...,...,...,...,...
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

In [13]:
Student_Performance

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
...,...,...,...,...,...,...,...,...
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

In [48]:
Student_Performance.lunch.describe()

count         1000
unique           2
top       standard
freq           645
Name: lunch, dtype: object

In [50]:
Student_Performance.lunch.value_counts()

standard        645
free/reduced    355
Name: lunch, dtype: int64

In [35]:
Student_Performance.gender.dtype

dtype('O')

In [37]:
pd.isnull(Student_Performance)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...
998,False,False,False,False,False,False,False,False
999,False,False,False,False,False,False,False,False

In [38]:
Student_Performance.lunch.replace("standard","correct")

0           correct
1           correct
           ...
998         correct
999    free/reduced
Name: lunch, Length: 1000, dtype: object

In [40]:
Student_Performance.rename(columns={'gender':'sex'})

,sex,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
...,...,...,...,...,...,...,...,...
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86